NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21B010F512IM32.svd
        <register>
          <name>FECCTRL</name>
          <description>No Description</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFF7</resetMask>
          <fields>
            <field>
              <name>BLOCKWHITEMODE</name>
              <description>Block Coder Whitener Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>The input data is passed directly to the output without any other operations.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WHITE</name>
                  <description>Data is whitened in TX and de-whitened in RX with the whitener feedback register updated every bit period.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTEWHITE</name>
                  <description>Data is whitened in TX and de-whitened in RX with the whitener feedback register updated every byte period,   recommended only for compatibility purposes.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERLEAVEDWHITE0</name>
                  <description>Data is whitened in TX after symbol interleaving and de-whitened in RX before symbol de-interleaving.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERLEAVEDWHITE1</name>
                  <description>Data is whitened in TX after symbol interleaving and de-whitened in RX before symbol de-interleaving.   The first 16 (if INTERLEAVEWIDTH is 0) or 32 (if INTERLEAVEWIDTH is 1) RF symbols are not whitened or de-whitened.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKCODEINSERT</name>
                  <description>Parity bits are added in TX and checked and removed in RX to perform block coding forward error correction (FEC).   In transmit mode, the block encoder will insert parity bits between the bit stream provided from the transmit buffer.   In receive mode, the block decoder will remove parity bits and they will not further be provided to the receive buffer.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKCODEREPLACE</name>
                  <description>Parity bits are added in TX and checked and removed in RX to perform block coding forward error correction (FEC).  In transmit mode, the block encoder will replace bits provided by the transmit buffer with parity bits.   In receive mode, the block decoder will output both data bits and parity bits to the receive buffer.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKLOOKUP</name>
                  <description>A lookup table is used to implement table lookup block coding in TX, and table lookup block decoding in RX.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONVMODE</name>
              <description>Convolutional Encoder / Decoder mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Convolutional encoding / decoding is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONVOLUTIONAL</name>
                  <description>Normal convolutional encoding / decoding is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEAT</name>
                  <description>Repeat-mode convolutional encoding / decoding is enabled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONVDECODEMODE</name>
              <description>Convolutional decoding mode setting.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFT</name>
                  <description>Use soft decision convolutional decoding, recommended in most cases.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARD</name>
                  <description>Use hard decision convolutional decoding.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONVTRACEBACKDISABLE</name>
              <description>Convolutional traceback disabling</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Traceback history is enabled, and convolutional decoding will use RAM to store state information.   In receive mode, output from convolutional decoding will be generated after the traceback history has reached a certain level.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Traceback history is disabled, and convolutional decoding will not use RAM to store state information.  No trellis termination sequence will be automatically appended to the transmit data.  In receive mode, output from convolutional decoding will be generated after every state transition. This will not provide  any convolutional decoding gain, but can be used to decode very simple codes without using any RAM memory.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONVINV</name>
              <description>Convolutional code symbol inversion</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERLEAVEMODE</name>
              <description>Interleaver mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Interleaving is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Interleaving is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXBUFFER</name>
                  <description>No symbol interleaving is performed, but the interleaver data storage is   used as a data buffer in receive mode. This may, for instance, be used for receiver  pause functionality.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXTXBUFFER</name>
                  <description>No symbol interleaving is performed, but the interleaver data storage is   used as a data buffer in receive and transmit mode. This may, for instance, be used for receiver  and transmitter pause functionality.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTERLEAVEFIRSTINDEX</name>
              <description>4-bit index of the first interleaver</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERLEAVEWIDTH</name>
              <description>Interleave symbol width.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Each interleaver element consists of one RF symbol</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Each interleaver element consists of two RF symbols</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONVBUSLOCK</name>
              <description>Convolutional decoding bus lock</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONVSUBFRAMETERMINATE</name>
              <description>Enable trellis termination for subframes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Trellis termination is applied at the end of the frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Trellis termination is applied at the end of each subframe and at the end of the frame.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGLEBLOCK</name>
              <description>Single block code per frame</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE2FSK</name>
              <description>Force use of 2-FSK</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONVHARDERROR</name>
              <description>Enable convolutional decoding hard error</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Convolutional hard error decoding is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Convolutional hard error decoding is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLOCKRAMADDR</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFC</resetMask>
          <fields>
            <field>
              <name>BLOCKRAMADDR</name>
              <description>Block decoding RAM address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONVRAMADDR</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFC</resetMask>
          <fields>
            <field>
              <name>CONVRAMADDR</name>
              <description>Convolutional decoding RAM address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000700</resetValue>
          <resetMask>0x00033FF7</resetMask>
          <fields>
            <field>
              <name>RANDOMTX</name>
              <description>Random TX Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UARTMODE</name>
              <description>Data Uart Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BITORDER</name>
              <description>Data Bit Order.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSBFIRST</name>
                  <description>Least Significant bit in each word is sent/received first.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSBFIRST</name>
                  <description>Most Significant bit in each word is sent/received first.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFCDMODE</name>
              <description>TX Frame Control Descriptor Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCDMODE0</name>
                  <description>FCD0 is reloaded when SCNT reaches 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCDMODE1</name>
                  <description>Use FCD0 for the first sub-frame, then switching between FCD0 and FCD1 for following sub-frames</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCDMODE2</name>
                  <description>Use FCD0 for the first sub-frame, then FCD1 is used for all following sub-frames</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCDMODE3</name>
                  <description>Use alternating FCD0 / FCD1 for each complete frame</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFCDMODE</name>
              <description>RX Frame Control Descriptor Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCDMODE0</name>
                  <description>FCD2 is reloaded when SCNT reaches 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCDMODE1</name>
                  <description>Use FCD2 for the first sub-frame, then switching between FCD2 and FCD3 for following sub-frames</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCDMODE2</name>
                  <description>Use FCD2 for the first sub-frame, then FCD3 is used for all following sub-frames</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCDMODE3</name>
                  <description>Use alternating FCD2 / FCD3 for each complete frame</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BITSPERWORD</name>
              <description>Bits Per Word, for first word in a frame</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RATESELECT</name>
              <description>MODEM rate select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPREFETCH</name>
              <description>Transmit prefetch data</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>The frame controller will start preparing transmit data when entering the TX state. This setting may be used  in most cases.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>The frame controller will start preparing transmit data already in the TXWARM, RX2TX or TX2TX state.  This setting must be used to avoid transmit underflow in the cases where no preamble or frame synchronization  is inserted by the modulator (i.e. typically when the MODEM control fields TXBASES is zero and SYNCDATA is set). </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQHANDSHAKE</name>
              <description>Sequencer data handshake</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>The sequencer may read transmit or read data through the FRCRD command, but   it will not wait for the sequencer to do so before proceeding to parse transmit or receive data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>The frame controller will require that the sequencer program uses the  FRCRD command to read both transmit and receive data which the frame controller stores in the DATABUFFER  register. If data is not read with this field set, the overflow (RXOF) or underflow (TXUF) will be set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRBSTEST</name>
              <description>Pseudo-Random Bit Sequence Testmode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
